# B6 Feature Engineering

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'C:\Users\kozhevnikovams\Downloads\log.csv', header = None)
log = pd.DataFrame(df)
log.columns = ['userid','time','n','m']
display(log)

                               userid                  time        n        m
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

Посмотреть пропуски в столбцах

In [3]:
log.head().isna()

   userid   time     n     m
0   False  False  True  True
1   False  False  True  True
2   False  False  True  True
3   False  False  True  True
4   False  False  True  True

## B6.2.1.1

Посчитайте количество пропусков в столбце time. Метод isna() есть не только у DataFrame, но и у Series. Это значит, что применять его можно не только ко всей таблице, но и к каждому столбцу отдельно.

In [4]:
log.time.isna().value_counts()

False    985
True      15
Name: time, dtype: int64

## B6.2.1.2

Удалите все столбцы, где есть пропуски. Запишите в поле, сколько осталось столбцов в данных после этого.

In [5]:
log.dropna(axis=1)

                               userid
0    Запись пользователя № - user_919
1    Запись пользователя № - user_973
2    Запись пользователя № - user_903
3    Запись пользователя № - user_954
4    Запись пользователя № - user_954
..                                ...
995  Запись пользователя № - user_984
996                            #error
997                            #error
998                            #error
999                            #error

[1000 rows x 1 columns]

## B6.2.1.3

Удалите все строки, где есть пропуски. Запишите в поле, сколько осталось строк в данных после этого.

In [6]:
log.dropna(axis=0)

,userid,time,n,m
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0
151,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0
189,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0
205,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0
...,...,...,...,...
967,Запись пользователя № - user_975,[2019-04-19 22:25:15,1000.0,6108.0
971,Запись пользователя № - user_912,[2019-04-20 10:35:49,10554.0,31799.0
972,Запись пользователя № - user_926,[2019-04-20 10:35:50,10354.0,30244.0
976,Запись пользователя № - user_970,[2019-04-20 10:35:54,10354.0,30691.0
991,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0

## B6.2.1.4

С признаками bet и win мы разберемся позже: пропуски в этих столбцах требуют особого подхода.

А сейчас удалите все столбцы, где есть пропуски, среди столбцов user_id и time. Запишите в поле, сколько осталось столбцов в данных после этого.

In [7]:
log.drop_duplicates(subset=['userid','time'])

                               userid                  time        n       m
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[986 rows x 4 columns]

## B6.2.2.1

Удалите дубли среди столбцов user_id и time. Запишите в поле ниже, сколько осталось строк после удаления дублей.

In [8]:
log.time.drop_duplicates()

0      [2019-01-01 14:06:51
1      [2019-01-01 14:51:16
2      [2019-01-01 16:31:16
3      [2019-01-01 17:17:51
4      [2019-01-01 21:31:18
               ...
991    [2019-04-20 12:55:41
992    [2019-04-20 14:59:36
993    [2019-04-20 17:09:56
994    [2019-04-20 18:10:07
995     [2019-04-20 9:59:58
Name: time, Length: 985, dtype: object

In [9]:
log.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   userid  1000 non-null   object
 1   time    985 non-null    object
 2   n       485 non-null    float64
 3   m       138 non-null    float64
dtypes: float64(2), object(2)
memory usage: 31.4+ KB

## B6.3.1.1

Уберите лишний символ, преобразуйте признак time к datetime. После этого найдите наибольшую дату и выведите ее без времени.

Подсказка: можно применить метод max() к получившемуся столбцу со временем.

Не забудьте избавиться от пропусков.
Запишите ответ в формате "YYYY-MM-DD".

In [10]:
def new_f (time):
   if str(time)[0]=='[' :
        return str(time)[1:]
log.time=log.time.apply(new_f)
log.time=pd.to_datetime(log.time)
minute_column = log.time.dt.minute

In [11]:
display(log.time.max())

Timestamp('2019-04-20 18:10:07')

In [12]:
import pandas as pd
log = pd.read_csv(r'C:\Users\kozhevnikovams\Downloads\log.csv', header=None)
log.columns = ['user_id','time','bet','win']
log =  log[log.user_id != '#error']
log['time'] = log['time'].apply(lambda x: x[1:])
log['time'] = pd.to_datetime(log['time'])
minute = log['time'].apply(lambda t: t.minute)
minute.value_counts()

36    25
31    23
6     22
50    22
43    21
14    21
18    21
12    21
5     21
40    21
29    21
53    21
48    20
2     20
45    20
57    20
58    20
27    19
21    19
56    19
54    18
9     18
20    18
3     18
35    18
34    18
33    18
47    18
10    17
51    17
55    16
25    16
17    16
37    15
15    15
16    15
49    15
30    15
24    15
38    15
28    15
4     14
19    14
7     14
44    14
32    14
1     13
59    13
41    13
23    12
39    12
0     12
13    11
22    11
42    11
46    10
52    10
8      9
26     9
11     6
Name: time, dtype: int64

## B6.4.1.1

Используйте оригинальный датасет log.csv. Результат запишите числом в поле ниже.

Подсказка: можно использовать value_counts().
Посчитайте, сколько раз люди приходили, но не делали ставок. Для этого заполните пропуски в столбце bet значением 0 и посчитайте количество таких значений.

In [13]:
import pandas as pd
log = pd.read_csv(r'C:\Users\kozhevnikovams\Downloads\log.csv')
log.columns = ['user_id','time','bet','win']
log['bet'] = log['bet'].fillna(0)
display(log)
log.bet.value_counts()

                              user_id                  time       bet      win
0    Запись пользователя № - user_973  [2019-01-01 14:51:16       0.0      NaN
1    Запись пользователя № - user_903  [2019-01-01 16:31:16       0.0      NaN
2    Запись пользователя № - user_954  [2019-01-01 17:17:51       0.0      NaN
3    Запись пользователя № - user_954  [2019-01-01 21:31:18       0.0      NaN
4    Запись пользователя № - user_917  [2019-01-01 23:34:55  156789.0      NaN
..                                ...                   ...       ...      ...
994  Запись пользователя № - user_984   [2019-04-20 9:59:58    9754.0      NaN
995                            #error                   NaN   10054.0  29265.0
996                            #error                   NaN   10454.0      NaN
997                            #error                   NaN    1000.0      NaN
998                            #error                   NaN   10754.0      NaN

[999 rows x 4 columns]

0.0          514
500.0         50
100.0         48
300.0         42
800.0         42
200.0         40
400.0         40
700.0         38
600.0         37
1000.0        37
900.0         30
9754.0        10
10554.0       10
10154.0        7
10254.0        7
10454.0        6
9954.0         6
10754.0        5
10654.0        5
10354.0        4
10054.0        4
9854.0         2
5000.0         1
27000.0        1
9876.0         1
156789.0       1
12945.0        1
12548.0        1
145732.0       1
1678321.0      1
98753.0        1
123981.0       1
104540.0       1
8700.0         1
950.0          1
8734.0         1
7650.0         1
Name: bet, dtype: int64

## B6.4.1.2

Используйте оригинальный датасет log.csv. Проделайте с ним действия из задания 1, расположенного выше на этой странице, и из пункта "Заполнение с помощью функции".

Результат запишите числом в поле ниже.

Подсказка: можно использовать sum().
Посчитайте, сколько раз участники ставок проиграли деньги. То есть посчитайте количество строк, для которых в столбце win находится отрицательное значение.

In [14]:
log = pd.read_csv(r'C:\Users\kozhevnikovams\Downloads\log.csv', header=None)
log.columns = ['user_id', 'time', 'bet', 'win']
log.bet = log[['bet']].fillna(0)
def fillna_win(row):
    if pd.isna(row.win):
        return 0
    else:
        return row.win
new_win = log.apply(lambda row: fillna_win(row), axis=1)
log['win'] = new_win

bad = log[(log.win == 0) & (log.bet > 0) & (log.bet > log.win)]
bad.win.value_counts()

#d = df[df.Age > 35]

0.0    347
Name: win, dtype: int64

## B6.4.2.2

Используйте датасет log.csv, получившийся в результате выполнения предыдущего задания. Посчитайте среднее значение выигрыша (из столбца net) в тех случаях, когда выигрыш больше 0. Результат округлите до целого, отбросив дробную часть.

In [15]:
log['net'] = log['win'] - log['bet']
real_win = log[log.net > 0]
real_win.net.mean()

80253.33333333333

## B6.4.2.3

Используйте датасет log.csv, получившийся в результате выполнения первого задания этого блока. Посчитайте медианное значение выигрыша (из столбца net) в тех случаях, когда выигрыш больше 0. Результат округлите до целого, отбросив дробную часть.

In [16]:
real_win = log[log.win > 0]
real_win.net.median()

5347.0

In [17]:
log.bet.mean()

3291.083

In [18]:
log.bet.sum() / log.bet.dropna().shape[0]

3291.083

In [19]:
log['bet'].dropna().mean()

3291.083

## B6.4.3.1

Посчитайте, какой процент посещений букмекерской конторы оборачивался ставкой. Для этого поделите количество ставок (значений больше 0) на общее количество посещений конторы.

In [20]:
bet_qtty = log[log.bet > 0]
total_visit = log['user_id'].count()
display(total_visit)
bet_qtty1 = bet_qtty.bet.count()
percent = bet_qtty1 / total_visit * 100
display(percent)

1000

48.5

## B6.4.3.2

Посчитайте среднее значение ставки (из столбца bet) в тех случаях, когда ставка была сделана. Результат округлите до целого, отбросив дробную часть.

In [21]:
bet_qtty.mean()

bet     6785.738144
win    27207.630928
net    20421.892784
dtype: float64

## B6.4.3.4

Посчитайте среднюю сумму потерь при проигрыше (из столбца net). Результат округлите до целого, отбросив дробную часть.

In [22]:
loss = log[log.net < 0]
loss.mean()

bet    3372.743516
win       0.000000
net   -3372.743516
dtype: float64

In [23]:
fd = pd.read_csv(r'C:\Users\kozhevnikovams\Downloads\users.csv', header = None, encoding = 'koi8_r', sep='\t')
us = pd.DataFrame(fd)
us.columns = ['userid', 'email', 'geo']
us.userid = us.userid.apply(lambda x: x.lower())
display(us)

       userid                     email          geo
0      юзверь                      мейл          Гео
1    user_943       Accumanst@gmail.com       Ижевск
2    user_908         Advismowr@mail.ru       Ижевск
3    user_962           Anachso@ukr.net    Краснодар
4    user_973          Antecia@inbox.ru        Пермь
..        ...                       ...          ...
96   user_959  UpdatesCurious@yahoo.com       Тюмень
97   user_901        V2artierso@mail.ru  Арзангелтск
98   user_970          Vashoterlo@bk.ru      Воронеж
99   user_965       Visuareda@yahoo.com      Воронеж
100  user_921              Aavast@ya.ru       Ижевск

[101 rows x 3 columns]

In [24]:
df = pd.read_csv(r'C:\Users\kozhevnikovams\Downloads\log.csv', header = None)
log = pd.DataFrame(df)
log.columns = ['userid','time','bet','win']
log = log[log.userid != '#error']  
log.userid = log.userid.str.split(' - ').apply(lambda x: x[1])
log['win'] = log['win'].apply(lambda x: x if x == x else 0)
log['bet'] = log['bet'].apply(lambda x: x if x == x else 0)
log['net'] = log['win'] - log['bet']
display(log)

       userid                  time      bet     win      net
0    user_919  [2019-01-01 14:06:51      0.0     0.0      0.0
1    user_973  [2019-01-01 14:51:16      0.0     0.0      0.0
2    user_903  [2019-01-01 16:31:16      0.0     0.0      0.0
3    user_954  [2019-01-01 17:17:51      0.0     0.0      0.0
4    user_954  [2019-01-01 21:31:18      0.0     0.0      0.0
..        ...                   ...      ...     ...      ...
991  user_965  [2019-04-20 12:55:41    800.0  6927.0   6127.0
992  user_967  [2019-04-20 14:59:36  10154.0     0.0 -10154.0
993  user_973  [2019-04-20 17:09:56  10254.0     0.0 -10254.0
994  user_977  [2019-04-20 18:10:07  10354.0     0.0 -10354.0
995  user_984   [2019-04-20 9:59:58   9754.0     0.0  -9754.0

[985 rows x 5 columns]

## B6.5.1.1

Объедините датасеты log.csv и users.csv по признаку user_id по примеру выше. Ответ запишите в поле ниже.
Запишите количество строк в получившейся таблице.

In [25]:
pd.merge(us, log, on='userid')

,userid,email,geo,time,bet,win,net
0,user_943,Accumanst@gmail.com,Ижевск,[2019-01-06 21:06:57,0.0,0.0,0.0
1,user_943,Accumanst@gmail.com,Ижевск,[2019-01-10 12:16:22,100.0,0.0,-100.0
2,user_943,Accumanst@gmail.com,Ижевск,[2019-01-27 1:18:47,100.0,0.0,-100.0
3,user_943,Accumanst@gmail.com,Ижевск,[2019-02-10 11:09:24,100.0,5456.0,5356.0
4,user_943,Accumanst@gmail.com,Ижевск,[2019-02-12 15:09:38,300.0,5245.0,4945.0
...,...,...,...,...,...,...,...
970,user_965,Visuareda@yahoo.com,Воронеж,[2019-04-20 12:55:41,800.0,6927.0,6127.0
971,user_921,Aavast@ya.ru,Ижевск,[2019-01-07 1:05:59,0.0,0.0,0.0
972,user_921,Aavast@ya.ru,Ижевск,[2019-02-05 14:08:57,0.0,0.0,0.0
973,user_921,Aavast@ya.ru,Ижевск,[2019-02-09 23:20:21,400.0,6067.0,5667.0
974,user_921,Aavast@ya.ru,Ижевск,[2019-02-10 17:53:37,900.0,0.0,-900.0

In [26]:
log.groupby('userid').win.median()

userid
user_1000    0.0
user_900     0.0
user_901     0.0
user_902     0.0
user_903     0.0
            ...
user_995     0.0
user_996     0.0
user_997     0.0
user_998     0.0
user_999     0.0
Name: win, Length: 101, dtype: float64

Посчитайте медиану баланса по каждому пользователю. Для этого сгруппируйте по пользователям, возьмите признак net, просуммируйте по каждому пользователю и получите медиану.

In [27]:
log.groupby('userid').net.sum().median()

2202.0

## B6.5.2.1

Используйте датасет, который получился в результате всех преобразований выше (в том числе, заполнение пропусков). Ответ запишите в поле ниже в виде целого числа (отбросьте дробную часть).
Посчитайте медиану баланса по каждому пользователю. Для этого сгруппируйте по пользователям, возьмите признак net, просуммируйте по каждому пользователю и получите медиану.

In [28]:
import pandas as pd
log = pd.read_csv(r'C:\Users\kozhevnikovams\Downloads\log.csv', header = None)
log.columns = ['user_id','time','bet','win']
log = log[log['bet'] == log['bet']]
log['win'] = log['win'].apply(lambda x: x if x == x else 0)

us = pd.read_csv(r'C:\Users\kozhevnikovams\Downloads\users.csv', encoding="KOI8-R", sep="\t")
us.columns = ['user_id', 'email', 'geo']
# Приведем признак user_id к одному формату в обоих датасетах
us.user_id = us.user_id.apply(lambda x: x.lower())
# Избавимся от ошибок в user_id
log = log[log.user_id != '#error']
log.user_id = log.user_id.str.split(' - ').apply(lambda x: x[1])

merged = pd.merge(us, log, on='user_id')
merged['net'] = merged['win'] - merged['bet']
merged.groupby('user_id').net.sum().median()

1986.0